In [1]:
import pandas as pd
import numpy as np
import os as os

In [2]:
air = pd.read_csv("airquality.csv",sep=',')

In [3]:


#1. Dimensions of Dataset
print("The dataset dimensions are:", air.shape)

#2. Structure of Dataset
print(air.dtypes)

#3. Column Names of Dataset 
print(air.columns)

#4. Summary of dataset
air.describe()

The dataset dimensions are: (153, 7)
Unnamed: 0      int64
Ozone         float64
Solar.R       float64
Wind          float64
Temp            int64
Month           int64
Day             int64
dtype: object
Index(['Unnamed: 0', 'Ozone', 'Solar.R', 'Wind', 'Temp', 'Month', 'Day'], dtype='object')

,Unnamed: 0,Ozone,Solar.R,Wind,Temp,Month,Day
count,153.000000,116.000000,146.000000,153.000000,153.000000,153.000000,153.000000
mean,77.000000,42.129310,185.931507,9.957516,77.882353,6.993464,15.803922
std,44.311398,32.987885,90.058422,3.523001,9.465270,1.416522,8.864520
min,1.000000,1.000000,7.000000,1.700000,56.000000,5.000000,1.000000
25%,39.000000,18.000000,115.750000,7.400000,72.000000,6.000000,8.000000
50%,77.000000,31.500000,205.000000,9.700000,79.000000,7.000000,16.000000
75%,115.000000,63.250000,258.750000,11.500000,85.000000,8.000000,23.000000
max,153.000000,168.000000,334.000000,20.700000,97.000000,9.000000,31.000000

In [4]:
#1.Fetch the observations for 9 day of June
air.query('Month == 6 and Day == 9' )

    Unnamed: 0  Ozone  Solar.R  Wind  Temp  Month  Day
39          40   71.0    291.0  13.8    90      6    9

In [5]:
#2.Find Average temperature for the month of June. 
j = air.query('Month == 6')[['Temp']]
print(j)
print(np.mean(j))

    Temp
31    78
32    74
33    67
34    84
35    85
36    79
37    82
38    87
39    90
40    87
41    93
42    92
43    82
44    80
45    79
46    77
47    72
48    65
49    73
50    76
51    77
52    76
53    76
54    76
55    75
56    78
57    73
58    80
59    77
60    83
Temp    79.1
dtype: float64

In [6]:
#3. To which day of June has the least temperature
h =  air.query('Month == 6')[['Temp','Day']]
h
h.min()[['Day']]

Day    1
dtype: int64

In [7]:
#4. Find Maximum Ozone value for the month of May

m= air.query('Month == 5')[['Ozone','Day']]
m.sort_values(by = "Ozone",ascending=False).head(n=1)[['Day']]

    Day
29   30

In [8]:
#5.Find the count of the missing values in the ozone column of the data set
air.Ozone.isnull().sum()

37

In [9]:
#6.Find out What is the mean of the Ozone column in this dataset

round(air.Ozone.mean(),2)

42.13

In [10]:
#7.Find out which month has the highest temperature
air.sort_values(by='Temp',ascending=False)[['Temp','Month']].head(n=1)

     Temp  Month
119    97      8

In [11]:
#8. Find out the wind value when the Ozone becomes maximum

#air.query('Ozone == Ozone.max()')[['Ozone','Wind']]
air.sort_values(by='Ozone',ascending=False)[['Ozone','Wind']].head(n=1)

     Ozone  Wind
116  168.0   3.4

In [12]:
#9. Find out the months for which the airquality observations have been carried out
air.Month.unique()

array([5, 6, 7, 8, 9], dtype=int64)

In [13]:
#10. Find the Ozone and temperature values for the 1st observation of every month
air.query("Day == 1")[["Month","Day","Ozone","Temp"]]

     Month  Day  Ozone  Temp
0        5    1   41.0    67
31       6    1    NaN    78
61       7    1  135.0    84
92       8    1   39.0    81
123      9    1   96.0    91

In [14]:
#11.Which day of which month corresponds to the least Ozone Value
air.query("Ozone == Ozone.min()")[["Month","Day","Ozone"]]

    Month  Day  Ozone
20      5   21    1.0

In [15]:
#12.Convert the temperature for all the observations to Centigrade scale

air['centigrade'] = (air.Temp-32)*(5/9)
print(air[['Temp','centigrade']])

     Temp  centigrade
0      67   19.444444
1      72   22.222222
2      74   23.333333
3      62   16.666667
4      56   13.333333
5      66   18.888889
6      65   18.333333
7      59   15.000000
8      61   16.111111
9      69   20.555556
10     74   23.333333
11     69   20.555556
12     66   18.888889
13     68   20.000000
14     58   14.444444
15     64   17.777778
16     66   18.888889
17     57   13.888889
18     68   20.000000
19     62   16.666667
20     59   15.000000
21     73   22.777778
22     61   16.111111
23     61   16.111111
24     57   13.888889
25     58   14.444444
26     57   13.888889
27     67   19.444444
28     81   27.222222
29     79   26.111111
..    ...         ...
123    91   32.777778
124    92   33.333333
125    93   33.888889
126    93   33.888889
127    87   30.555556
128    84   28.888889
129    80   26.666667
130    78   25.555556
131    75   23.888889
132    73   22.777778
133    81   27.222222
134    76   24.444444
135    77   25.000000
136    71   21.666667
137    71   21.666667
138    78   25.555556
139    67   19.444444
140    76   24.444444
141    68   20.000000
142    82   27.777778
143    64   17.777778
144    71   21.666667
145    81   27.222222
146    69   20.555556
147    63   17.222222
148    70   21.111111
149    77   25.000000
150    75   23.888889
151    76   24.444444
152    68   20.000000

[153 rows x 2 columns]